/*Дарт программалоо - Операторлор
1) Операндтар - маалыматтарды билдирет
2) Оператор - Наркты өндүрүү үчүн операнддар кантип иштетилерин аныктайт.

3) Төмөнкү туюнтманы карап көрөлү - "2 + 3". Бул туюнтмада 2 жана 3 операнддар жана "+" (плюс) символу оператор болуп саналат .

4) Бул бөлүмдө биз Dartта бар операторлорду талкуулайбыз.
Арифметикалык операторлор
Теңдик жана байланыш операторлору
Типти сыноо операторлору
Bitwise операторлору
Дайындоо операторлору
Логикалык операторлор

5) Арифметикалык операторлор
Төмөнкү таблицада Dart колдогон арифметикалык операторлор көрсөтүлгөн.
	+ кошуу, − Кемитүү, * Көбөйт, / Бөлүү, ~/ Бөлүү, бүтүн натыйжаны кайтаруу,
  % Бүтүн бөлүмдүн калганын алыңыз (модуль), ++ Көбөйтүү, -- Азайтуу.

6) Теңдик жана байланыш операторлору
Реляциялык операторлор эки объекттин ортосундагы мамиленин түрүн сынайт же аныктайт. Реляциялык операторлор логикалык маанини кайтарышат, б.а. true/false.
А маанисин 10 жана В 20 деп эсептейли.
>	караганда чоңураак	(A > B) False
<	караганда азыраак	(A <B) туура
>=	чоңураак же барабар	(A >= B) False
<=	Аз же барабар	(A <= B) Чындык
==	Теңдик	(A==B) False
!=	Барабар эмес	(A!=B) туура

7) Типти сыноо операторлору
Бул операторлор иштөө учурунда түрлөрүн текшерүү үчүн ыңгайлуу.
болуп саналат	Эгер объекттин көрсөтүлгөн түрү болсо, true
болуп саналат!	Эгерде объекттин көрсөтүлгөн түрү бар болсо, False.

8) Дайындоо операторлору
Төмөнкү таблицада Dartта жеткиликтүү дайындоо операторлорунун тизмеси келтирилген.
8.1) =(Жөнөкөй тапшырма)
Оң тараптагы операнддан сол тараптагы операндга маанилерди дайындайт
Мисал: C = A + B A + B маанисин Cга ыйгарат.

8.2)  ??=
Өзгөрмө нөл болгондо гана маанини дайындаңыз.

8.3) 	+=(Кошуу жана дайындоо)
Ал оң операндды сол операндга кошуп, натыйжаны сол операндга дайындайт.
Мисал: C += A C = C + A эквиваленттүү

8.4)  ─=(Кемитүү жана дайындоо)
Ал оң операндды сол операнддан чыгарып, натыйжаны сол операндга дайындайт.
Мис : C -= A C = C - A эквиваленттүү

8.5)  *=(Көбөйтүү жана дайындоо)
Ал оң операндды сол операнд менен көбөйтөт жана натыйжаны сол операндга дайындайт.
Мис : C *= A C = C * A эквиваленттүү

8.6)  /=(Бөлүү жана дайындоо)
Ал оң операнд менен сол операндды бөлүп, натыйжаны сол операндга дайындайт.

Эскертүү − Ушул эле логика Bitwise операторлоруна тиешелүү, ошондуктан алар ≪=, ≫=, ≫=, ≫=, |= жана ^= болуп калат.

9) Логикалык операторлор
Логикалык операторлор эки же андан көп шарттарды бириктирүү үчүн колдонулат. Логикалык операторлор логикалык маанини кайтарышат. А өзгөрмөнүн маанисин 10 жана В 20 деп эсептейли.
&& Жана − Эгерде бардык көрсөтүлгөн туюнтмалар чындыкка кайтарылса гана оператор true кайтарат
(A > 10 && B > 10) False.

10) ||	ЖЕ − Эгерде көрсөтүлгөн туюнтмалардын жок дегенде бири чындыкты кайтарса, оператор true кайтарат
(A > 10 || B > 10) туура.

11) !	ЭМЕС – Оператор туюнтма натыйжасынын тескерисин кайтарат. Мисалы: !(7>5) жалганды кайтарат
!(A > 10) туура.

12) Шарттуу туюнтмалар
Дарттын эки оператору бар, алар ifelse билдирүүлөрүн талап кылышы мүмкүн болгон туюнтмаларды баалоого мүмкүндүк берет -

абалы? expr1 : expr2
Эгерде шарт чын болсо, анда туюнтма expr1ди баалайт (жана анын маанисин кайтарат); антпесе, ал баа берет жана expr2 маанисин кайтарат .

expr1 ?? expr2
Эгерде expr1 нөл эмес болсо, анын маанисин кайтарат; антпесе, экспр2 маанисин баалайт жана кайтарат

Мисал
Төмөнкү мисал Dart − ичинде шарттуу туюнтманы кантип колдонсоңуз болорун көрсөтөт

void main() { 
   var a = 10; 
   var res = a > 12 ? "value greater than 10":"value lesser than or equal to 10"; 
   print(res); console: value lesser than or equal to 10
} 

Дагы бир мисалды алалы -
void main() { 
   var a = null; 
   var b = 12; 
   var res = a ?? b; 
   print(res); console: 12
}


*/
void main() {
  print(res1);
  print(res2);
  print(plus);
  print(minus);
  print(koboyt);
  print(boluu);
  print(kaldyk);
  print(butun);
  a++;
  b--;
  print(a);
  print(b);
}

int a = 20;
int b = 3;

int plus = a + b;
int minus = a - b;
int koboyt = a * b;
double boluu = a / b;
int kaldyk = a % b;
int butun = a ~/ b;

var c = null;
var d = 12;
var res1 = c ?? d;

var i = 10;
var res2 = i > 12 ? "мааниси 10дон жогору" : "10дон аз же барабар маани";

int aa = 1;
double bb = 1.1;
num cc = 100.55;
dynamic gg = true;
