import 'package:variables_1/variables_1.dart' as variables_1;

/*
ДАРТТАГЫ ӨЗГӨРМӨЛӨР
1) Өзгөрмөлөр
Өзгөрмөлөр программадагы маанини сактоо үчүн колдонулган контейнерлер. Ар кандай маанилерди сактай турган 
өзгөрмөлөрдүн ар кандай түрлөрү бар. Бул жерде өзгөрмө түзүү жана аны инициализациялоонун мисалы.

2) // бул жерде өзгөрмө аты Джон маанисин камтыйт.
var name = "John";


3) Өзгөрмө түрлөрү
Алар маалымат түрлөрү деп аталат. Биз кийинчерээк бул дарт окуу куралында маалымат түрлөрү жөнүндө көбүрөөк
билебиз.
String : Тексттин маанисин сактоо үчүн. Мисалы, "Джон" [Тырмакчада болушу керек]
int : бүтүн санды сактоо үчүн. Мисалы, 10, -10, 8555 [Ондук камтылган эмес]
double : калкыма чекиттин маанилерин сактоо үчүн. Мисалы, 10.0, -10.2, 85.698 [Ондук камтылган]
num : Сандын каалаган түрүн сактоо үчүн. Мисалы, 10, 20.2, -20 [int жана эки эсе]
bool : Чын же жалганды сактоо үчүн. Мисалы, true, false [Чын же жалган маанилерди гана сактайт]
var : Кандайдыр бир маанини сактоо үчүн. Мисалы, 'Bimal', 12, 'z', чын.
dynamic : Каалаган маанини сактай алат.

4) Синтаксис
type variableName = value;

5) Эскертүү : Ар дайым сүрөттөмө өзгөрмө атын колдонуңуз. a, b, c сыяктуу өзгөрмө атын колдонбоңуз, анткени
бул сиздин кодуңузду татаалыраак кылат.
Дартта өзгөрмөлөрдү түзүү эрежелери
Өзгөрмө аттары регистрге сезимтал, б.а., a жана A ар башка.
Өзгөрмө аты тамгалардан жана алфавиттерден турушу мүмкүн.
Өзгөрмө аты сан менен башталбайт.
Ачкыч сөздөрдү өзгөрмө аты катары колдонууга уруксат берилбейт.
Өзгөрмө аталышында бош орундарга жол берилбейт.
Төмөнкү сызык (_) жана доллар ($) белгисинен башка өзгөчө белгилерге жол берилбейт.

6) Dart Constant
Туруктуу - мааниси эч качан өзгөрбөгөн өзгөрмөнүн түрү. Программалоодо өзгөрүлүүчү маанилер өзгөрүлүүчү 
жана өзгөрүлгүс маанилер өзгөрүлгүс . Кээде жарыялангандан кийин маанини өзгөртүүнүн кереги жок. PI = 3.14
 мааниси сыяктуу, ал эч качан өзгөрбөйт. Dartта константа түзүү үчүн const ачкыч сөзүн колдонсоңуз болот.
void main(){
const pi = 3.14;
pi = 4.23; // not possible  
print("Value of PI is $pi");
}

7) Дарттагы өзгөрмөлөргө ат коюу конвенциясы
Ат коюу шартын сактоо жакшы адат. Dart Variables'те өзгөрмөнүн аты кичине тамга менен башталышы керек жана 
ар бир экинчи сөздүн биринчи тамгасы num1, fullName, isMarried ж.б.

*/

void main() {
//Өзгөрмөлөрдү жарыялоо
  String name = "Jhon";
  String address = 'USA';
  String a = 'I\'m rich';
  num age = 20; // сандардын бардык түрлөрүн сактоо үчүн колдонулат
  num height = 5.9;
  bool isMarried = false;

// өзгөрмөлөрдүн маанисин басып чыгаруу
  print("Анын аты $name");
  print("Адреси $address");
  print("Абалы $a");
  print("Жашы $age");
  print("Бийиктиги $height");
  print("Үй-бүлөөлүк абалы $isMarried");
}

/* Озгөрмөлөр жыйындысы

*/

