//Паритет маселеси: Бүтүн санды кабыл ала турган функцияны жазыңыз жана эгер сан жуп болсо
//"чындык", ал эми сан так болсо "жалган" деп кайтарат.

int num1 = 4;
int num2 = 7;
void main() {
  bool isEven(int number) {
    return number % 2 == 0;
  }

  print('$num1 jup sany ${isEven(num1)}');
  print('$num2 tak sany ${isEven(num2)}');
}
// bool isEven(int number) {
  //   //isEven функциясында 2ге бөлүнгөн сандын калганын текшерүү үчүн модул операторун (%)
  //   // колдонобуз. Эгерде калган 0 болсо, анда сан жуп болот жана функция чындыкты кайтарат.
  //   // Болбосо, калган 0 болбосо, сан так жана функция жалганды кайтарат.
  //   return number % 2 == 0;
  // }

  //  //Негизги функцияда биз жөн гана эки үлгүдөгү (num1 жана num2) isEven функциясын чакырып,
  //  // натыйжаларды консолго басып чыгарабыз.
  // print("$num1 is even: ${isEven(num1)}");
  // print("$num2 is even: ${isEven(num2)}");