/*
Демейки конструктор
Эгерде сиз конструктор түзбөсөңүз, дарт компилятору тарабынан автоматтык
түрдө түзүлгөн конструктор default конструктор деп аталат. Default
конструктордун параметрлери жок. Default конструктор класстын аталышынан
кийин кашаа () менен жарыяланат.

1-мисал: Дарттын демейки конструктору
Төмөндөгү бул мисалда эки касиети бар ноутбук классы бар : бренд жана сыйлык .
Параметри жок конструктор түзүүгө жана конструктордон бир нерсени басып 
чыгарууга мүмкүнчүлүк берет. Бизде ошондой эле ноутбук деп аталган Laptop
классынын объекти бар .
 */
class Laptop {
  String? brend;
  int? prize;
  //constructor
  Laptop() {
    print('Bul defoltny constructor');
  }
}

/*
2-мисал: Дарттын демейки конструктору
Төмөндөгү бул мисалда төрт касиети бар Студент классы бар: аты , жашы , мектептин аты жана 
класс . Демейки конструктор мектеп аталышынын маанилерин инициализациялоо үчүн колдонулат. 
Мунун себеби, мектептин аты бардык окуучулар үчүн бирдей. Ошондой эле бизде Студент деген
класстын объекти бар . Демейки конструктор класстын объектисин түзгөндө автоматтык түрдө 
чакырылат.
 */
class Student {
  String? name;
  int? age;
  String? schoolname;
  String? grade;
  //Defoltny constructor
  Student() {
    print(
        'Constructor called'); // бул конструктордун чакырылганын же жокпу текшерүү үчүн.
    schoolname = 'ABC School';
  }
}

void main() {
  // Бул жерде ноутбук Ноутбук классынын объектиси болуп саналат.
  Laptop laptop = Laptop();
  //2-мисал:
  print('2-мисал');
  Student student = Student();
  student.name = 'Adilbek';
  student.age = 18;
  student.grade = 'A';
  print('Name is: ${student.name}');
  print('Age is ${student.age}');
  print('Grade is: ${student.grade}');
  print('School name is: ${student.schoolname}');
}
